# MPG Cars

### Introduction:

The following exercise utilizes data from [UC Irvine Machine Learning Repository](https://archive.ics.uci.edu/ml/datasets/Auto+MPG)

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the first dataset [cars1](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv) and [cars2](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv).

   ### Step 3. Assign each to a variable called cars1 and cars2

In [17]:
cars1 = pd.read_csv('cars1.csv')
cars2 = pd.read_csv('cars2.csv')

In [18]:
cars1.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,NaN,NaN,NaN,NaN,NaN
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,NaN,NaN,NaN,NaN,NaN
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,NaN,NaN,NaN,NaN,NaN
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,NaN,NaN,NaN,NaN,NaN
4,17.0,8,302,140,3449,10.5,70,1,ford torino,NaN,NaN,NaN,NaN,NaN

### Step 4. Oops, it seems our first dataset has some unnamed blank columns, fix cars1

In [19]:
cars1 = cars1.loc[:,'mpg':'car']

In [20]:
cars1.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

### Step 5. What is the number of observations in each dataset?

In [21]:
cars1.shape[0]

198

In [22]:
cars2.shape[0]

200

### Step 6. Join cars1 and cars2 into a single DataFrame called cars

In [28]:
cars = pd.concat([cars1,cars2],axis=0)
cars = cars.reset_index()

In [29]:
cars.head()

,index,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,4,17.0,8,302,140,3449,10.5,70,1,ford torino

### Step 7. Oops, there is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [30]:
owners = np.random.randint(15000,73000,cars.shape[0])
owners

array([51195, 34822, 61533, 15806, 29863, 18063, 19528, 16051, 16095,
       23292, 31736, 72869, 37850, 21210, 54140, 15790, 67619, 28464,
       27541, 23105, 58358, 39911, 36935, 23547, 17540, 41655, 22837,
       32293, 52392, 64020, 65981, 63351, 20678, 39152, 27704, 36986,
       50600, 54146, 44269, 35738, 52211, 53575, 60338, 60832, 15309,
       32200, 33442, 23055, 42277, 17681, 21993, 38559, 58135, 31081,
       28604, 46887, 30483, 41435, 51374, 53991, 24001, 44854, 64795,
       61873, 55664, 46166, 57932, 41690, 48052, 70434, 26055, 15802,
       72718, 45101, 63938, 71950, 62240, 52088, 21681, 34671, 68993,
       64622, 54112, 54542, 43121, 54906, 38344, 49282, 26851, 30211,
       34954, 71850, 44554, 59128, 17951, 43617, 70350, 59638, 70623,
       35205, 56600, 62994, 43178, 72092, 47882, 56618, 55613, 72722,
       60826, 24938, 50067, 41410, 58208, 34980, 37858, 16928, 70799,
       23029, 66853, 69155, 50563, 42969, 33649, 42438, 37077, 39407,
       37358, 30438, 22967, 33188, 24999, 63013, 63605, 33868, 22567,
       42414, 41790, 24630, 63421, 33263, 71212, 43916, 52411, 60301,
       58611, 59190, 42399, 43539, 56697, 30584, 45121, 48491, 17899,
       15992, 33791, 41595, 58562, 45383, 21052, 51381, 60787, 54135,
       66906, 54498, 55018, 61277, 59449, 25203, 18720, 36463, 56211,
       54162, 27748, 56194, 44888, 23149, 72110, 43376, 62188, 50362,
       71996, 66619, 70647, 60262, 36413, 48769, 67024, 52206, 30067,
       51198, 66049, 53836, 30032, 16979, 47507, 51433, 54037, 22104,
       53250, 45501, 65162, 21411, 30559, 29428, 41573, 64056, 37510,
       38128, 48143, 51928, 70087, 59646, 69545, 67994, 34287, 71545,
       46484, 29988, 46530, 67231, 67671, 31454, 22245, 38988, 48288,
       71786, 17421, 55941, 49650, 23063, 55493, 56452, 42834, 59970,
       34100, 52686, 15281, 25845, 54058, 57549, 20548, 25268, 27971,
       58617, 19956, 68438, 56508, 19949, 35888, 30352, 23490, 70629,
       61456, 71627, 42492, 40222, 15312, 26256, 43308, 58196, 24760,
       56713, 60256, 15332, 68592, 47732, 42420, 20035, 30194, 71841,
       48548, 15979, 67820, 63274, 23409, 31568, 42693, 34255, 60423,
       39273, 71208, 18707, 57433, 37126, 57162, 21743, 38122, 23884,
       32427, 25040, 65352, 43072, 67276, 22993, 69197, 66990, 53199,
       51326, 68733, 63056, 27747, 44913, 19778, 57600, 45578, 40361,
       19148, 40478, 30431, 31332, 51453, 50416, 27566, 38901, 48280,
       39911, 28341, 44179, 59563, 35563, 22745, 41860, 35059, 28137,
       17457, 26698, 23885, 20841, 48905, 30155, 62035, 56348, 68855,
       56414, 30165, 57518, 46181, 50099, 52753, 34074, 22301, 62533,
       69251, 65101, 71875, 39923, 16390, 47025, 62155, 67124, 66919,
       22229, 71981, 69405, 56114, 49639, 48122, 19699, 38489, 21923,
       57680, 30073, 44125, 44257, 44341, 50042, 30345, 47460, 25693,
       21986, 20193, 46769, 16021, 56387, 35564, 25719, 54222, 25601,
       28258, 47073, 42868, 17018, 29603, 25775, 69448, 43771, 59198,
       47307, 51214, 63711, 55311, 66036, 69882, 28428, 61305, 52325,
       37527, 42684])

### Step 8. Add the column owners to cars

In [31]:
cars['owners']=owners

In [32]:
cars.head()

,index,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,owners
0,0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,51195
1,1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,34822
2,2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,61533
3,3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,15806
4,4,17.0,8,302,140,3449,10.5,70,1,ford torino,29863